# Задача 2: Найдите сумму цифр трехзначного числа.
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

# a = int(input('Введите трехзначное целое число: '))
# summa = 0
# if 100 <= a <= 999:
#     while a > 0:
#         summa += a % 10
#         a //= 10
#     print(f'Cумму цифр положительного трехзначного целого числа равна {summa}.')
# elif -999 <= a <= -100:
#     a = -a
#     while a > 0:
#         summa += a % 10
#         a //= 10
#     print(f'Cумму цифр отрицательного трехзначного целого числа равна {summa}.')
# else:
#     print('Ошибка! Введите трехзначное целое число')

